redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_FM_OFF_1nd/redis_result_Gauss110_FM_OFF_P5_1nd_20230717183625.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        25962.50          ---          ---         3.50311         3.35900         6.84700         7.80700     28041.53 
Gets         2595.26      1755.80       839.46         3.44476         3.35900         6.81500         7.74300      1947.67 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      28557.76      1755.80       839.46         3.49781         3.35900         6.84700         7.80700     29989.20 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.383        0.000
SET       2.991        5.000
SET       3.087       10.000
SET       3.167       15.000
SET       3.215       20.000
SET       3.247       25.000
SET       3.263       30.000
SET       3.295       35.000
SET       3.311       40.000
SET       3.343       45.000
SET       3.359       50.000
SET       3.375       52.500
SET       3.391       55.000
SET       3.391       57.500
SET       3.407       60.000
SET       3.423       62.500
SET       3.439       65.000
SET       3.455       67.500
SET       3.471       70.000
SET       3.487       72.500
SET       3.503       75.000
SET       3.519       76.250
SET       3.519       77.500
SET       3.535       78.750
SET       3.551       80.000
SET       3.551       81.250
SET       3.567       82.500
SET       3.599       83.750
SET       3.615       85.000
SET       3.631       86.250
SET       3.679       87.500
SET       3.695       88.125
SET       3.711       88.750
SET       3.743       89.375
SET       3.775       90.000
SET       3.791       90.625
SET       3.823       91.250
SET       3.855       91.875
SET       3.903       92.500
SET       3.935       93.125
SET       3.967       93.750
SET       3.983       94.062
SET       4.015       94.375
SET       4.031       94.688
SET       4.063       95.000
SET       4.127       95.312
SET       4.159       95.625
SET       4.223       95.938
SET       4.287       96.250
SET       4.415       96.562
SET       4.767       96.875
SET       4.959       97.031
SET       5.503       97.188
SET       6.143       97.344
SET       6.303       97.500
SET       6.399       97.656
SET       6.495       97.812
SET       6.527       97.969
SET       6.591       98.125
SET       6.623       98.281
SET       6.687       98.438
SET       6.687       98.516
SET       6.719       98.594
SET       6.751       98.672
SET       6.751       98.750
SET       6.783       98.828
SET       6.815       98.906
SET       6.847       98.984
SET       6.847       99.062
SET       6.879       99.141
SET       6.911       99.219
SET       6.943       99.258
SET       6.943       99.297
SET       6.975       99.336
SET       6.975       99.375
SET       7.007       99.414
SET       7.039       99.453
SET       7.039       99.492
SET       7.071       99.531
SET       7.103       99.570
SET       7.135       99.609
SET       7.135       99.629
SET       7.167       99.648
SET       7.199       99.668
SET       7.231       99.688
SET       7.263       99.707
SET       7.295       99.727
SET       7.327       99.746
SET       7.391       99.766
SET       7.423       99.785
SET       7.487       99.805
SET       7.519       99.814
SET       7.551       99.824
SET       7.583       99.834
SET       7.615       99.844
SET       7.647       99.854
SET       7.679       99.863
SET       7.711       99.873
SET       7.743       99.883
SET       7.775       99.893
SET       7.839       99.902
SET       7.839       99.907
SET       7.871       99.912
SET       7.903       99.917
SET       7.903       99.922
SET       7.935       99.927
SET       7.967       99.932
SET       7.999       99.937
SET       8.031       99.941
SET       8.063       99.946
SET       8.095       99.951
SET       8.127       99.954
SET       8.159       99.956
SET       8.191       99.958
SET       8.191       99.961
SET       8.255       99.963
SET       8.319       99.966
SET       8.319       99.968
SET       8.319       99.971
SET       8.383       99.973
SET       8.447       99.976
SET       8.447       99.977
SET       8.511       99.978
SET       8.511       99.979
SET       8.511       99.980
SET       8.575       99.982
SET       8.575       99.983
SET       8.639       99.984
SET       8.703       99.985
SET       8.703       99.987
SET       8.831       99.988
SET       9.087       99.988
SET       9.663       99.989
SET       9.983       99.990
SET      10.367       99.990
SET      10.751       99.991
SET      10.943       99.991
SET      11.519       99.992
SET     544.767       99.993
SET     544.767       99.993
SET     544.767       99.994
SET     544.767       99.994
SET     544.767       99.995
SET     544.767       99.995
SET     544.767       99.995
[...]
SET     544.767       99.996
SET     544.767       99.996
SET     544.767       99.996
SET     544.767       99.997
SET     544.767       99.997
SET     544.767       99.997
[...]
SET     544.767       99.998
SET     544.767       99.998
SET     544.767       99.998
[...]
SET     544.767       99.999
SET     544.767       99.999
SET     544.767       99.999
[...]
SET     544.767      100.000
SET     548.863      100.000
SET     548.863      100.000
---
GET       1.023        0.000
GET       2.975        5.000
GET       3.087       10.000
GET       3.151       15.000
GET       3.199       20.000
GET       3.231       25.000
GET       3.263       30.000
GET       3.295       35.000
GET       3.311       40.000
GET       3.327       45.000
GET       3.359       50.000
GET       3.359       52.500
GET       3.375       55.000
GET       3.391       57.500
GET       3.407       60.000
GET       3.407       62.500
GET       3.423       65.000
GET       3.439       67.500
GET       3.455       70.000
GET       3.471       72.500
GET       3.487       75.000
GET       3.487       76.250
GET       3.503       77.500
GET       3.519       78.750
GET       3.519       80.000
GET       3.535       81.250
GET       3.551       82.500
GET       3.551       83.750
GET       3.567       85.000
GET       3.583       86.250
GET       3.615       87.500
GET       3.615       88.125
GET       3.631       88.750
GET       3.647       89.375
GET       3.663       90.000
GET       3.679       90.625
GET       3.711       91.250
GET       3.727       91.875
GET       3.759       92.500
GET       3.791       93.125
GET       3.823       93.750
GET       3.839       94.062
GET       3.855       94.375
GET       3.887       94.688
GET       3.903       95.000
GET       3.935       95.312
GET       3.967       95.625
GET       4.015       95.938
GET       4.079       96.250
GET       4.191       96.562
GET       4.575       96.875
GET       4.767       97.031
GET       4.991       97.188
GET       5.823       97.344
GET       6.175       97.500
GET       6.335       97.656
GET       6.431       97.812
GET       6.495       97.969
GET       6.559       98.125
GET       6.591       98.281
GET       6.623       98.438
GET       6.655       98.516
GET       6.687       98.594
GET       6.719       98.672
GET       6.719       98.750
GET       6.751       98.828
GET       6.783       98.906
GET       6.815       98.984
GET       6.847       99.062
GET       6.879       99.141
GET       6.911       99.219
GET       6.911       99.258
GET       6.943       99.297
GET       6.943       99.336
GET       6.975       99.375
GET       6.975       99.414
GET       7.007       99.453
GET       7.007       99.492
GET       7.039       99.531
GET       7.071       99.570
GET       7.103       99.609
GET       7.103       99.629
GET       7.135       99.648
GET       7.167       99.668
GET       7.167       99.688
GET       7.199       99.707
GET       7.231       99.727
GET       7.263       99.746
GET       7.327       99.766
GET       7.359       99.785
GET       7.423       99.805
GET       7.423       99.814
GET       7.487       99.824
GET       7.519       99.834
GET       7.551       99.844
GET       7.615       99.854
GET       7.615       99.863
GET       7.647       99.873
GET       7.679       99.883
GET       7.711       99.893
GET       7.743       99.902
GET       7.775       99.907
GET       7.807       99.912
GET       7.807       99.917
GET       7.839       99.922
GET       7.871       99.927
GET       7.903       99.932
GET       7.935       99.937
GET       7.935       99.941
GET       7.967       99.946
GET       8.031       99.951
GET       8.031       99.954
GET       8.127       99.956
GET       8.159       99.958
GET       8.191       99.961
GET       8.191       99.963
GET       8.191       99.966
GET       8.255       99.968
GET       8.255       99.971
GET       8.255       99.973
GET       8.255       99.976
GET       8.255       99.977
GET       8.319       99.978
GET       8.319       99.979
GET       8.319       99.980
GET       8.319       99.982
GET       8.319       99.983
GET       8.383       99.984
GET       8.383       99.985
GET       8.383       99.987
GET       8.447       99.988
GET       8.447       99.988
GET       8.447       99.989
GET       8.447       99.990
GET       8.511       99.990
GET       8.575       99.991
GET       8.575       99.991
GET       8.575       99.992
GET       8.575       99.993
GET       8.575       99.993
GET       8.575       99.994
GET       8.575       99.994
GET       8.575       99.995
GET       8.639       99.995
GET       8.639       99.995
GET       8.703       99.995
GET       8.703       99.996
GET       8.703       99.996
GET       8.703       99.996
GET       8.703       99.997
GET       8.767       99.997
GET       8.767       99.997
GET       8.767       99.997
[...]
GET       8.767       99.998
GET      10.111       99.998
GET      10.111       99.998
GET      10.111       99.998
[...]
GET     544.767       99.998
GET     544.767      100.000
---
WAIT      0.000      100.000